Конфигурация/InformationRegisters/РасчетныеПоказателиДепозитногоВклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеПоказателиДепозитногоВклада</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭффективнаяСтавкаПроцента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЭффективнуюПроцентнуюСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПоЭффективнойПроцентнойСтавке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитныйВклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДоговорыСчетовДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыСчетовДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Оповещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкиПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьСписокПолучателейИзИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокЗначений</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/РасчетныеПоказателиДепозитногоВклада/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДепозитныйВклад") Тогда
			
			СрезПоследних = РегистрыСведений.УсловияКредитныхИнструментов.СрезПоследних(?(ДанныеЗаполнения.Свойство("Период"), ДанныеЗаполнения.Период, ТекущаяДата()), Новый Структура("КредитныйИнструмент", ДанныеЗаполнения.ДепозитныйВклад));
			СрезПоследних.Сортировать("ДатаНачалаДействияУсловий УБЫВ");
			ЗаполнилиПоСрезу = Ложь;
			Для Каждого ДанныеСреза Из СрезПоследних Цикл
				Если НЕ ДанныеСреза.Действует Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого Колонка Из СрезПоследних.Колонки Цикл
					Если Колонка.Имя = "КредитныйИнструмент" 
						ИЛИ Колонка.Имя = "Комментарий" 
						ИЛИ Колонка.Имя = "Период" 
						ИЛИ Колонка.Имя = "ДатаНачалаДействияУсловий" Тогда 
						Продолжить; 
					КонецЕсли;
					Если ДанныеЗаполнения.Свойство(Колонка.Имя) И ЗначениеЗаполнено(ДанныеЗаполнения[Колонка.Имя])	Тогда 
						Продолжить; 
					КонецЕсли;
					
					ДанныеЗаполнения.Вставить(Колонка.Имя, ДанныеСреза[Колонка.Имя]);
				КонецЦикла;
				
				ЗаполнилиПоСрезу = Истина;
				Прервать;
			КонецЦикла;
			Если НЕ ЗаполнилиПоСрезу Тогда
				ДанныеЗаполнения.Вставить("Период", ДанныеЗаполнения.ДепозитныйВклад.ДатаРегистрации);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "ДепозитныйВклад");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Справочники.ДепозитныеВклады.БылиДвиженияПоДепозиту(Запись.ДепозитныйВклад, Запись.Организация) Тогда
			
			РеквизитыОповещения = Новый Структура;
			РеквизитыОповещения.Вставить("Организация",								Запись.Организация);
			РеквизитыОповещения.Вставить("Депозит",									Запись.ДепозитныйВклад);
			РеквизитыОповещения.Вставить("ИспользоватьЭффективнуюПроцентнуюСтавку",	Запись.ИспользоватьЭффективнуюПроцентнуюСтавку);
			РеквизитыОповещения.Вставить("ЭффективнаяСтавкаПроцента",				Запись.ЭффективнаяСтавкаПроцента);
			РеквизитыОповещения.Вставить("СчетДоверительногоУправления",			Справочники.СчетаДоверительногоУправления.ПустаяСсылка());
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
				|ИЗ
				|	РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
				|			&Период,
				|			Договор В
				|				(ВЫБРАТЬ ПЕРВЫЕ 1
				|					ДепозитныеВклады.БанковскийСчет.Договор КАК БанковскийСчетДоговор
				|				ИЗ
				|					Справочник.ДепозитныеВклады КАК ДепозитныеВклады
				|				ГДЕ
				|					ДепозитныеВклады.Ссылка = &ДепозитныйВклад)) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних";
			
			Запрос.УстановитьПараметр("ДепозитныйВклад", Запись.ДепозитныйВклад);
			Запрос.УстановитьПараметр("Период", Запись.Период);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РеквизитыОповещения.Вставить("СчетДоверительногоУправления", ВыборкаДетальныеЗаписи.СчетДоверительногоУправления);
			КонецЦикла;
			
			Справочники.Оповещения.СформироватьОповещения("РегистрСведений.РасчетныеПоказателиДепозитногоВклада", Перечисления.ТипыСобытий.ПриЗаписиРегистраСведений, РеквизитыОповещения);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
